Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t
Serialization structure for AnalysisModelGeneralProperties.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.AnalysisEngineName
Name of analysis engine.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.ModelName
Name of model.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.ModelCreationType
Model creation type.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.ModalAnalysisModel
Model analysis model.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.aFilterName
Name of filter.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.MemberAxisLocation
Location of member axis.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.NodeDefinition
Node definition.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.ExtendedClashCheck
ExtendedClashCheck.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.ModelMerging
Model merging.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.MemberEndReleaseMethodByConnection
MemberEndReleaseMethodByConnection.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.ToStruct(Tekla.Structures.Analysis.AnalysisModelGeneralProperties)
DO NOT USE! For internal usage only!
P: P.

Tekla.Structures.AnalysisInternal.dotAnalysisModelGeneralProperties_t.FromStruct(Tekla.Structures.Analysis.AnalysisModelGeneralProperties)
DO NOT USE! For internal usage only!
P: P.